### Importing libraries

In [1]:
import pandas as pd

#### Customer Data Cleaning

In [2]:
#loading customer data
df_customer = pd.read_csv("AdventureWorks_Customers.csv", encoding='latin1')

In [3]:
# Dropping unnecessary columns not required for analysis
df_customer.drop(columns=['Prefix','BirthDate','EmailAddress'], inplace=True)

In [4]:
#combining first and last name of customer
df_customer['CustomerName'] = (df_customer['FirstName'].str.title()
                                + " " 
                                +  df_customer['LastName'].str.title())

In [5]:
#dropping original first and last name column
df_customer.drop(columns=['FirstName','LastName'],inplace=True)

In [6]:
#checking null values in customers data
df_customer.isnull().sum()

CustomerKey         0
MaritalStatus       0
Gender            130
AnnualIncome        0
TotalChildren       0
EducationLevel      0
Occupation          0
HomeOwner           0
CustomerName        0
dtype: int64

In [7]:
#filling null values in gender column with 'unknown'
df_customer['Gender'] = df_customer['Gender'].fillna('Unknown')

In [8]:
#dataset after filling null values
df_customer.isnull().sum()

CustomerKey       0
MaritalStatus     0
Gender            0
AnnualIncome      0
TotalChildren     0
EducationLevel    0
Occupation        0
HomeOwner         0
CustomerName      0
dtype: int64

In [9]:
#removed dollar sign from price column
df_customer['AnnualIncome'] = df_customer['AnnualIncome'].str.replace('$','',regex=False)

In [10]:
df_customer['AnnualIncome'] = df_customer['AnnualIncome'].replace({',':''}, regex=True)

In [11]:
df_customer = df_customer[
            ['CustomerKey','CustomerName'] + 
[col for col in df_customer if col not in['CustomerKey','CustomerName']]
]

In [12]:
#saving cleaned data file
df_customer.to_csv('df_customer.csv',index=False)

In [13]:
df_customer.head(2)

,CustomerKey,CustomerName,MaritalStatus,Gender,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner
0,11000,Jon Yang,M,M,90000,2,Bachelors,Professional,Y
1,11001,Eugene Huang,S,M,60000,3,Bachelors,Professional,N

#### Product Categories Data

In [14]:
#loading product categories data
df_product_categories = pd.read_csv('AdventureWorks_Product_Categories.csv')

In [15]:
df_product_categories

   ProductCategoryKey CategoryName
0                   1        Bikes
1                   2   Components
2                   3     Clothing
3                   4  Accessories

In [16]:
df_product_categories.to_csv('df_product_categories.csv',index=False)

#### Products Subcategories Data

In [17]:
#loading product subcategories data
df_product_subcategories = pd.read_csv('AdventureWorks_Product_Subcategories.csv')

In [18]:
df_product_subcategories.to_csv('df_product_subcategories.csv',index=False)

#### Products Data

In [19]:
#loading product data
df_products = pd.read_csv('AdventureWorks_Products.csv')

In [20]:
#checking null values in products data
df_products.isnull().sum()

ProductKey                0
ProductSubcategoryKey     0
ProductSKU                0
ProductName               0
ModelName                 0
ProductDescription        0
ProductColor             50
ProductSize               0
ProductStyle              0
ProductCost               0
ProductPrice              0
dtype: int64

In [21]:
df_products.columns

Index(['ProductKey', 'ProductSubcategoryKey', 'ProductSKU', 'ProductName',
       'ModelName', 'ProductDescription', 'ProductColor', 'ProductSize',
       'ProductStyle', 'ProductCost', 'ProductPrice'],
      dtype='object')

In [22]:
# Dropping unnecessary columns not required for analysis
df_products.drop(columns=['ProductDescription','ProductSize','ProductStyle'], axis=1, inplace=True)

In [23]:
df_products.columns

Index(['ProductKey', 'ProductSubcategoryKey', 'ProductSKU', 'ProductName',
       'ModelName', 'ProductColor', 'ProductCost', 'ProductPrice'],
      dtype='object')

In [24]:
#filled null values in productcolor column with unknown
df_products['ProductColor'] = df_products['ProductColor'].fillna('Unknown')

In [25]:
#products data after removing null values
df_products.isnull().sum()

ProductKey               0
ProductSubcategoryKey    0
ProductSKU               0
ProductName              0
ModelName                0
ProductColor             0
ProductCost              0
ProductPrice             0
dtype: int64

In [26]:
df_products.head(2)

,ProductKey,ProductSubcategoryKey,ProductSKU,ProductName,ModelName,ProductColor,ProductCost,ProductPrice
0,214,31,HL-U509-R,"Sport-100 Helmet, Red",Sport-100,Red,13.0863,34.9900
1,215,31,HL-U509,"Sport-100 Helmet, Black",Sport-100,Black,12.0278,33.6442

In [27]:
df_products.to_csv('df_products.csv', index=False)

#### Returns Data

In [28]:
#loading returns data
df_returns = pd.read_csv('AdventureWorks_Returns.csv')

In [29]:
df_returns.head()

  ReturnDate  TerritoryKey  ProductKey  ReturnQuantity
0  1/18/2015             9         312               1
1  1/18/2015            10         310               1
2  1/21/2015             8         346               1
3  1/22/2015             4         311               1
4   2/2/2015             6         312               1

In [30]:
df_returns.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1809 entries, 0 to 1808
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ReturnDate      1809 non-null   object
 1   TerritoryKey    1809 non-null   int64
 2   ProductKey      1809 non-null   int64
 3   ReturnQuantity  1809 non-null   int64
dtypes: int64(3), object(1)
memory usage: 56.7+ KB

In [31]:
#changed returndate column from object to datetime
df_returns['ReturnDate'] = pd.to_datetime(df_returns['ReturnDate'],
                                          format='%m/%d/%Y', errors='coerce')

In [32]:
df_returns.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1809 entries, 0 to 1808
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ReturnDate      1809 non-null   datetime64[ns]
 1   TerritoryKey    1809 non-null   int64
 2   ProductKey      1809 non-null   int64
 3   ReturnQuantity  1809 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 56.7 KB

In [33]:
df_returns.isnull().sum()

ReturnDate        0
TerritoryKey      0
ProductKey        0
ReturnQuantity    0
dtype: int64

In [34]:
df_returns['ReturnDate'] = df_returns['ReturnDate'].dt.strftime('%Y-%m-%d')

In [35]:
df_returns.head()

   ReturnDate  TerritoryKey  ProductKey  ReturnQuantity
0  2015-01-18             9         312               1
1  2015-01-18            10         310               1
2  2015-01-21             8         346               1
3  2015-01-22             4         311               1
4  2015-02-02             6         312               1

In [36]:
df_returns.to_csv('df_returns.csv',index=False)

#### Territories Data

In [37]:
#loading territories data
df_territories = pd.read_csv('AdventureWorks_Territories.csv')

In [38]:
df_territories.head()

   SalesTerritoryKey     Region        Country      Continent
0                  1  Northwest  United States  North America
1                  2  Northeast  United States  North America
2                  3    Central  United States  North America
3                  4  Southwest  United States  North America
4                  5  Southeast  United States  North America

In [39]:
df_territories.isnull().sum()

SalesTerritoryKey    0
Region               0
Country              0
Continent            0
dtype: int64

In [40]:
df_territories.to_csv('df_territories.csv', index=False)

#### Sales and Orders Data Cleaning

In [41]:
#loading sales and orders data
df_sales_2015 = pd.read_csv('AdventureWorks_Sales_2015.csv')

In [42]:
df_sales_2016 = pd.read_csv('AdventureWorks_Sales_2016.csv')

In [43]:
df_sales_2017 = pd.read_csv('AdventureWorks_Sales_2017.csv')

In [44]:
#combined all three dataframes in one df
df_sales = pd.concat([df_sales_2015,df_sales_2016,df_sales_2017], axis=0, ignore_index=True)

In [45]:
df_sales.head()

,OrderDate,StockDate,OrderNumber,ProductKey,CustomerKey,TerritoryKey,OrderLineItem,OrderQuantity
0,1/1/2015,9/21/2001,SO45080,332,14657,1,1,1
1,1/1/2015,12/5/2001,SO45079,312,29255,4,1,1
2,1/1/2015,10/29/2001,SO45082,350,11455,9,1,1
3,1/1/2015,11/16/2001,SO45081,338,26782,6,1,1
4,1/2/2015,12/15/2001,SO45083,312,14947,10,1,1

In [46]:
# Dropping unnecessary columns not required for analysis
df_sales.drop(columns=['StockDate','OrderLineItem'],inplace=True)

In [47]:
df_sales.head()

  OrderDate OrderNumber  ProductKey  CustomerKey  TerritoryKey  OrderQuantity
0  1/1/2015     SO45080         332        14657             1              1
1  1/1/2015     SO45079         312        29255             4              1
2  1/1/2015     SO45082         350        11455             9              1
3  1/1/2015     SO45081         338        26782             6              1
4  1/2/2015     SO45083         312        14947            10              1

In [48]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56046 entries, 0 to 56045
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   OrderDate      56046 non-null  object
 1   OrderNumber    56046 non-null  object
 2   ProductKey     56046 non-null  int64
 3   CustomerKey    56046 non-null  int64
 4   TerritoryKey   56046 non-null  int64
 5   OrderQuantity  56046 non-null  int64
dtypes: int64(4), object(2)
memory usage: 2.6+ MB

In [49]:
#changed orderdate column to datetime
df_sales['OrderDate'] = pd.to_datetime(df_sales['OrderDate'],
                                      format='%m/%d/%Y', errors='coerce')

In [50]:
df_sales['OrderDate'] = df_sales['OrderDate'].dt.strftime('%Y-%m-%d')

In [51]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56046 entries, 0 to 56045
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   OrderDate      56046 non-null  object
 1   OrderNumber    56046 non-null  object
 2   ProductKey     56046 non-null  int64
 3   CustomerKey    56046 non-null  int64
 4   TerritoryKey   56046 non-null  int64
 5   OrderQuantity  56046 non-null  int64
dtypes: int64(4), object(2)
memory usage: 2.6+ MB

In [52]:
df_sales.isnull().sum()

OrderDate        0
OrderNumber      0
ProductKey       0
CustomerKey      0
TerritoryKey     0
OrderQuantity    0
dtype: int64

In [53]:
df_sales.to_csv('df_sales.csv',index=False)

In [54]:
df_sales.head()

,OrderDate,OrderNumber,ProductKey,CustomerKey,TerritoryKey,OrderQuantity
0,2015-01-01,SO45080,332,14657,1,1
1,2015-01-01,SO45079,312,29255,4,1
2,2015-01-01,SO45082,350,11455,9,1
3,2015-01-01,SO45081,338,26782,6,1
4,2015-01-02,SO45083,312,14947,10,1